import matplotlib.pyplot as plt

data = [
    [19, [123, [2, 2, 0, 0]], [199, [2, 1, 0, 1]], [280, [2, 3, 0, 0]]],
    [20, [129, [2, 2, 0, 0]], [199, [2, 1, 0, 1]], [280, [2, 3, 0, 0]]],
    [21, [129, [2, 2, 0, 0]], [199, [2, 1, 0, 1]], [280, [2, 3, 0, 0]]],
    [22, [144, [2, 2, 1, 0]], [209, [2, 1, 1, 1]], [315, [2, 2, 0, 0]]],
    [23, [144, [2, 2, 0, 1]], [213, [2, 1, 0, 2]], [335, [2, 3, 0, 0]]],
    [24, [150, [2, 2, 0, 1]], [213, [2, 1, 0, 2]], [335, [2, 3, 0, 0]]],
    [25, [150, [2, 2, 0, 1]], [213, [2, 1, 0, 2]], [335, [2, 3, 0, 0]]],
    [26, [150, [2, 2, 1, 0]], [264, [2, 1, 1, 1]], [335, [2, 3, 0, 0]]],
    [27, [156, [2, 2, 0, 1]], [268, [2, 1, 0, 2]], [390, [2, 3, 0, 0]]],
    [28, [171, [2, 2, 0, 1]], [268, [2, 1, 0, 2]], [390, [2, 3, 0, 0]]],
    [29, [171, [2, 2, 0, 1]], [268, [2, 1, 0, 2]], [390, [2, 3, 0, 0]]],
    [30, [171, [2, 2, 2, 0]], [268, [2, 1, 0, 2]], [390, [2, 3, 0, 0]]],
    [31, [177, [2, 2, 1, 1]], [278, [2, 1, 1, 2]], [400, [2, 3, 1, 0]]],
    [32, [177, [2, 2, 0, 2]], [278, [2, 1, 1, 2]], [404, [2, 3, 0, 1]]],
    [33, [183, [2, 2, 0, 2]], [278, [2, 1, 1, 2]], [404, [2, 3, 0, 1]]],
    [34, [183, [2, 2, 2, 0]], [278, [2, 1, 1, 2]], [404, [2, 3, 0, 1]]],
    [35, [183, [2, 2, 1, 1]], [333, [2, 1, 1, 2]], [455, [2, 3, 1, 0]]],
    [36, [189, [2, 2, 0, 2]], [333, [2, 1, 1, 2]], [459, [2, 3, 0, 1]]],
    [37, [204, [2, 2, 0, 2]], [333, [2, 1, 1, 2]], [459, [2, 3, 0, 1]]],
    [38, [204, [2, 2, 0, 2]], [333, [2, 1, 1, 2]], [459, [2, 3, 0, 1]]],
]
# Инициализируем массивы для трех полос
W_values = []
W_1_values = []
W_2_values = []

# Разбираем данные и добавляем их в соответствующие массивы
for row in data:
    y = row[0]
    W = row[1][0]
    W_1 = row[2][0]
    W_2 = row[3][0]

    W_values.append(W)
    W_1_values.append(W_1)
    W_2_values.append(W_2)

# Создаем график
plt.figure(figsize=(10, 6))
plt.plot(range(19, 39), W_values, label='b',marker='o')
plt.plot(range(19, 39), W_1_values, label='b-1',marker='o')
plt.plot(range(19, 39), W_2_values, label='b-2',marker='o')
plt.xlabel('Средства')
plt.ylabel('Эффективность')
plt.legend()
plt.title('Задача 2')
plt.grid(True)

# Отображаем график
plt.show()

data = [
    [21, 78, 92, 114],
    [22, 80, 96, 118],
    [23, 82, 100, 122],
    [24, 88, 104, 132],
    [25, 92, 110, 136],
    [26, 96, 114, 140],
    [27, 100, 118, 144],
    [28, 104, 122, 154],
    [29, 106, 126, 158],
    [30, 110, 132, 162],
    [31, 114, 136, 166],
    [32, 118, 140, 176],
    [33, 122, 144, 180],
    [34, 126, 148, 184],
    [35, 130, 154, 188],
    [36, 132, 158, 198],
    [37, 136, 162, 202],
    [38, 140, 166, 206],
    [39, 144, 170, 210],
    [40, 148, 176, 220],
    [41, 152, 180, 224],
    [42, 156, 184, 228]
]

# Извлекаем данные для каждой полосы
Y = [row[0] for row in data]
W = [row[1] for row in data]
W_1 = [row[2] for row in data]
W_2 = [row[3] for row in data]

# Создаем график с линиями
plt.figure(figsize=(10, 6))
plt.plot(Y, W, label='W', marker='o')
plt.plot(Y, W_1, label='W-1', marker='o')
plt.plot(Y, W_2, label='W-2', marker='o')
plt.xlabel('Средства')
plt.ylabel('Эффективность')
plt.title('Задача 1')
plt.legend()
plt.grid(True)

# Отображаем график
plt.show()

data = [
    [122, 707, 707],
    [123, 707, 707],
    [125, 707, 707],
    [126, 707, 707],
    [127, 707, 707],
    [128, 707, 707],
    [129, 707, 707],
    [130, 707, 707],
    [131, 707, 707],
    [132, 707, 707],
    [133, 707, 707],
    [134, 707, 707],
    [135, 707, 707],
    [136, 707, 707],
    [137, 707, 707],
    [138, 707, 707],
    [139, 707, 707],
    [140, 707, 707],
    [141, 707, 707],
    [142, 707, 707],
    [143, 707, 707],
    [143, 707, 707]
]

# Извлекаем данные для каждой полосы
Y = [row[0] for row in data]
a = [row[1] for row in data]
a_plus_1 = [row[2] for row in data]

# Создаем график с линиями
plt.figure(figsize=(10, 6))
plt.plot(Y, a, label='a', marker='o')
plt.plot(Y, a_plus_1, label='a+1', marker='o')
plt.xlabel('Средства')
plt.ylabel('Эффективность')
plt.title('Задача 3')
plt.legend()
plt.grid(True)

# Отображаем график
plt.show()